#Напишите программу на ассемблере RISC-V,
#которая заполняет массив из 16+n целых чисел значениями из стандартного ввода.
#Программа считывает значения в цикле и завершает чтение,
#когда считаны все 16+n значения или когда считано значение 0 (n – номер студента в группе)
.data
array: .space 144
.text
.globl main

main:
    la   t0, array
    li   t1, 0
    li   t2, 36

loop:
    li   a7, 5
    ecall
    beqz a0, exit
    sw   a0, 0(t0)
    addi t0, t0, 4
    addi t1, t1, 1
    blt  t1, t2, loop

exit:
    li   a7, 10
    ecall